   # Visual Data Analysis of Fraudulent Transactions

In [4]:
# initial imports
import pandas as pd
import calendar
import plotly.express as px
import hvplot.pandas
from sqlalchemy import create_engine

In [7]:
# create a connection to the database
engine = create_engine("postgresql://postgres:password@localhost:5432/sql-homework-db")
# engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_detection")

   ## Data Analysis Questions 1

   Use `hvPlot` to create a line plot showing a time series from the transactions along all the year for **card holders 2 and 18**. In order to contrast the patterns of both card holders, create a line plot containing both lines. What difference do you observe between the consumption patterns? Does the difference could be a fraudulent transaction? Explain your rationale.

In [34]:
# loading data for card holder 2 and 18 from the database
# query = "SELECT * FROM transactions"
# transactions = pd.read_sql(query, engine)
# transactions

cardholder_ids = [ 2, 18 ]
cardholder_ids_str = str(cardholder_ids).replace('[', '(').replace(']', ')')

# Get card numbers
query = f"SELECT * FROM credit_card WHERE id_card_holder = {cardholder_ids[0]} or id_card_holder = {cardholder_ids[1]}"
# query = f"SELECT * FROM credit_card WHERE id_card_holder = 2                   or id_card_holder = 18"
card_numbers = pd.read_sql(query, engine)

# Get cardholder names
card_holder_names = pd.read_sql(f"SELECT * FROM card_holder WHERE id = {cardholder_ids[0]} or id = {cardholder_ids[1]}", engine)

# Get transactions
card_numbers_str = str(card_numbers.card.to_list()).replace('[', '(').replace(']', ')')
transactions = pd.read_sql(f"SELECT * FROM transactions WHERE card IN {card_numbers_str}", engine)

transactions

       id        date  amount                 card  id_merchant
0     567  2018-01-01    2.95        4498002758300           64
1    2077  2018-01-05    1.36      344119623920892           30
2    2439  2018-01-06    1.33  4866761290278198714          127
3    1867  2018-01-06   10.82  4866761290278198714           70
4    3457  2018-01-07  175.00      344119623920892           12
..    ...         ...     ...                  ...          ...
227  1994  2018-12-27    1.70      344119623920892           55
228   114  2018-12-28    3.46        4498002758300           82
229  1228  2018-12-28   12.88      344119623920892           60
230   962  2018-12-28   11.03         675911140852            2
231  1218  2018-12-29   12.25        4498002758300            6

[232 rows x 5 columns]

In [40]:
card_numbers

                  card  id_card_holder
0  4866761290278198714               2
1         675911140852               2
2        4498002758300              18
3      344119623920892              18

In [43]:
# loading data for card holder 2 and 18 from the database - using JOIN
query = f"SELECT * FROM credit_card as cc INNER JOIN transactions as t ON t.card = cc.card INNER JOIN card_holder as ch ON ch.id = cc.id_card_holder WHERE cc.id_card_holder IN {cardholder_ids_str}"

# query = f"SELECT * FROM credit_card as cc  INNER JOIN transactions as t ON t.card = cc.card INNER JOIN card_holder as ch ON ch.id = cc.id_card_holder"

# query = f"""SELECT *
#     FROM credit_card as cc
#     WHERE cc.id_card_holder IN {cardholder_ids_str}
#     INNER JOIN transactions as t ON t.card = cc.card
#     INNER JOIN card_holder as ch ON ch.id = cc.id_card_holder
# """


query
transactions = pd.read_sql(query, engine)
transactions

,card,id_card_holder,id,date,amount,card,id_merchant,id,name
0,4498002758300,18,567,2018-01-01,2.95,4498002758300,64,18,Malik Carlson
1,344119623920892,18,2077,2018-01-05,1.36,344119623920892,30,18,Malik Carlson
2,4866761290278198714,2,2439,2018-01-06,1.33,4866761290278198714,127,2,Shane Shaffer
3,4866761290278198714,2,1867,2018-01-06,10.82,4866761290278198714,70,2,Shane Shaffer
4,344119623920892,18,3457,2018-01-07,175.00,344119623920892,12,18,Malik Carlson
...,...,...,...,...,...,...,...,...,...
227,344119623920892,18,1994,2018-12-27,1.70,344119623920892,55,18,Malik Carlson
228,4498002758300,18,114,2018-12-28,3.46,4498002758300,82,18,Malik Carlson
229,344119623920892,18,1228,2018-12-28,12.88,344119623920892,60,18,Malik Carlson
230,675911140852,2,962,2018-12-28,11.03,675911140852,2,2,Shane Shaffer
231,4498002758300,18,1218,2018-12-29,12.25,4498002758300,6,18,Malik Carlson

In [24]:
str(cardholder_ids).replace('[', '(').replace(']', ')')
cardholder_ids_str
f"SELECT * FROM transactions WHERE card IN {cardholder_ids_str}"

str(card_numbers.card.to_list()).replace('[', '(').replace(']', ')')

"('4866761290278198714', '675911140852', '4498002758300', '344119623920892')"

In [ ]:
# plot for cardholder 2

In [ ]:
# plot for cardholder 18

In [ ]:
# combined plot for card holders 2 and 18

   ### Conclusions for Question 1

   ## Data Analysis Question 2

   Use `Plotly Express` to create a series of six box plots, one for each month, in order to identify how many outliers could be per month for **card holder id 25**. By observing the consumption patters, do you see any anomalies? Write your own conclusions about your insights.

In [ ]:
# loading data of daily transactions from jan to jun 2018 for card holder 25

In [ ]:
# change the numeric month to month names

In [ ]:
# creating the six box plots using plotly express

   ### Conclusions for Question 2